app/Controllers/Back/Obat.php

SELECT *
FROM `tbl_obat`
---
    public function ambildata()
    {
        if ($this->request->isAJAX()) {

            $data = [
                'tampildata' => $this->Obat->findAll()
            ];