app/Views/Page/Beranda.php

$level = $session->get('level');
$nama = $session->get('nama_user');
$this->db = \config\Database::connect();
$pasien = $this->db->table('tbl_pasien')->countAllResults();
$obat = $this->db->table('tbl_obat')->countAllResults();
$transaksi = $this->db->table('tbl_riwayat_transaksi')->countAllResults();
$pengguna = $this->db->table('tbl_user')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_pasien`
SELECT COUNT(*) AS `numrows`
FROM `tbl_obat`
SELECT COUNT(*) AS `numrows`
FROM `tbl_riwayat_transaksi`
SELECT COUNT(*) AS `numrows`
FROM `tbl_user`