app/Controllers/Klasemen.php

    public function ambildata()
    {
        if ($this->request->isAJAX()) {
            $data = [
                'tampildata' => $this->Klasemen->findAll()
            ];
---
SELECT *
FROM `klasemen`