app/Controllers/Pertandingan.php

SELECT *
FROM `pertandingan`
---
    public function ambildata()
    {
        if ($this->request->isAJAX()) {
            $data = [
                'tampildata' => $this->Pertandingan->findAll()
            ];

INSERT INTO `pertandingan` (`klub1`, `klub2`, `score1`, `score2`) VALUES ('18', '17', '3', '0')
UPDATE `klasemen` SET `ma` = 1, `me` = 1, `s` = '0', `k` = '0', `gm` = 3, `gk` = 0, `point` = 3
WHERE `klasemen`.`id_klasemen` IN ('11')
UPDATE `klasemen` SET `ma` = 1, `me` = '0', `s` = '0', `k` = 1, `gm` = 0, `gk` = 3, `point` = '0'
WHERE `klasemen`.`id_klasemen` IN ('10')
---
                        'score1' => $this->request->getPost('score1'),
                        'score2' => $this->request->getPost('score2'),
                    ];
                    $this->Pertandingan->insert($simpandata);
                    $this->Klasemen->update($id_klasemen1, $updataklasemen1);
                    $this->Klasemen->update($id_klasemen2, $updataklasemen2);